DataProcessors/АР_ПодборПараметровРасшифровкиПлатежаДляАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>АР_ПодборПараметровРасшифровкиПлатежаДляАренды</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодбиратьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДляПодбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_ПериодАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_СчетНаАренду</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_УслугаАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_Депозит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_Пени</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаНаАренду</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетНаАренду</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/АР_СпособыПогашенияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>АР_СпособыПогашенияПени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СперваПениПотомОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СперваОсновнойДолгПотомПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестиОбособленныйУчетПени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/АР_ПодборПараметровРасшифровкиПлатежаДляАренды/Forms/ПараметрыЗаполнения/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СхемаКомпоновкиДанных = Обработки.АР_ПодборПараметровРасшифровкиПлатежаДляАренды.ПолучитьМакет("Макет");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДолговПоРегистру(АдресВременногоХранилища)
	
	СхемаКомпоновкиДанных = Обработки.АР_ПодборПараметровРасшифровкиПлатежаДляАренды.ПолучитьМакет("Макет");
	СхемаКомпоновкиДанных.Параметры.Найти("Контрагент").Значение = Контрагент;
	СхемаКомпоновкиДанных.Параметры.Найти("Организация").Значение = Организация;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		РасшифровкаПлатежа = Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(РасшифровкаПлатежа);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	Если Не Объект.СпособЗаполнения = 2 Тогда
		
		Если Объект.ПодбиратьСумму Тогда
			
			Если Объект.СпособЗаполнения = 1 Тогда
				РасшифровкаПлатежа.Сортировать("ДатаВозникновения Убыв");
			Иначе
				РасшифровкаПлатежа.Сортировать("ДатаВозникновения Возр");
			КонецЕсли;
			
			Сч = 0;
			ВсегоПлатежей = 0;
			Пока Сч < РасшифровкаПлатежа.Количество() Цикл
				
				СтрокаДолг = РасшифровкаПлатежа[Сч];  				
				Если ВсегоПлатежей + СтрокаДолг.СуммаПлатежа <= Объект.СуммаДляПодбора Тогда
					
					СуммаПлатежа = СтрокаДолг.СуммаПлатежа;
					ВсегоПлатежей = ВсегоПлатежей + СуммаПлатежа;
					Сч = Сч + 1;
					
				ИначеЕсли ВсегоПлатежей < Объект.СуммаДляПодбора Тогда
					
					СуммаПлатежа = Объект.СуммаДляПодбора - ВсегоПлатежей;
					СтрокаДолг.СуммаПлатежа = СуммаПлатежа;
					ВсегоПлатежей = ВсегоПлатежей + СуммаПлатежа;
					Сч = Сч + 1;
					
				Иначе
					
					РасшифровкаПлатежа.Удалить(Сч);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Объект.ПодбиратьСумму И ВсегоПлатежей < Объект.СуммаДляПодбора Тогда
				
				СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
				СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДляПодбора - ВсегоПлатежей;
				
			КонецЕсли;	
		КонецЕсли;
		
	Иначе
		
		Сч = 0;
		ВсегоПлатежей = 0;
		Пока Сч < РасшифровкаПлатежа.Количество() Цикл
			
			СтрокаДолг = РасшифровкаПлатежа[Сч];  				
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ДоговорКонтрагента", СтрокаДолг.ДоговорКонтрагента);
			СтруктураОтбора.Вставить("АР_ПериодАренды", СтрокаДолг.АР_ПериодАренды);
			СтруктураОтбора.Вставить("АР_СчетНаАренду", СтрокаДолг.АР_СчетНаАренду);
			СтруктураОтбора.Вставить("АР_УслугаАренды", СтрокаДолг.АР_УслугаАренды);
			СтруктураОтбора.Вставить("АР_ОбъектАренды", СтрокаДолг.АР_ОбъектАренды);
			СтруктураОтбора.Вставить("АР_Депозит", СтрокаДолг.АР_Депозит);
			СтруктураОтбора.Вставить("АР_Пени", СтрокаДолг.АР_Пени);
			
			СтрокиДокумента = Объект.РасшифровкаПлатежа.НайтиСтроки(СтруктураОтбора);
			Если СтрокиДокумента.Количество() = 0 Тогда
				ЕстьСтрокиТЧ = Ложь;
			Иначе
				ЕстьСтрокиТЧ = Истина;
			КонецЕсли;
			
			Если ЕстьСтрокиТЧ Тогда
				
				Если Объект.ПодбиратьСумму Тогда
					
					Если ВсегоПлатежей + СтрокаДолг.СуммаПлатежа <= Объект.СуммаДляПодбора Тогда
						
						СуммаПлатежа = СтрокаДолг.СуммаПлатежа;
						ВсегоПлатежей = ВсегоПлатежей + СуммаПлатежа;
						Сч = Сч + 1;
						
					ИначеЕсли ВсегоПлатежей < Объект.СуммаДляПодбора Тогда
						
						СуммаПлатежа = Объект.СуммаДляПодбора - ВсегоПлатежей;
						СтрокаДолг.СуммаПлатежа = СуммаПлатежа;
						ВсегоПлатежей = ВсегоПлатежей + СуммаПлатежа;
						Сч = Сч + 1;
						
					Иначе
						РасшифровкаПлатежа.Удалить(Сч);
					КонецЕсли;
					
				Иначе
					Сч = Сч + 1;
				КонецЕсли;
			Иначе
				РасшифровкаПлатежа.Удалить(Сч);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрокаРасчета Из РасшифровкаПлатежа Цикл
		ПараметрыНачисленияПени = АР_ПроцедурыНачисления.ПолучитьПараметрыНачисленияПени(СтрокаРасчета.ДоговорКонтрагента, СтрокаРасчета.ДатаВозникновения);
		ОбособленныйУчетПени = ?(ПараметрыНачисленияПени = Неопределено, Ложь, ПараметрыНачисленияПени.СпособПогашенияПени = ПредопределенноеЗначение("Перечисление.АР_СпособыПогашенияПени.ВестиОбособленныйУчетПени"));
		Если НЕ ОбособленныйУчетПени Тогда
			СтрокаРасчета.АР_Пени = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(РасшифровкаПлатежа);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПодбиратьСумму = Ложь;
	ИнициализироватьКомпоновщикНастроек();
	
	Если Параметры.Свойство("Контрагент") Тогда
		ЭтаФорма.Контрагент = Параметры.Контрагент;	
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ЭтаФорма.Организация = Параметры.Организация;	
	КонецЕсли;
	Если Параметры.Свойство("СуммаДляПодбора") Тогда
		Объект.СуммаДляПодбора = Параметры.СуммаДляПодбора;	
	КонецЕсли;
	Если Параметры.Свойство("АдресВременногоХранилища") Тогда
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилища);
		Объект.РасшифровкаПлатежа.Загрузить(ТаблицаЗначений);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	АдресВременногоХранилища = "";
	ЗаполнитьСписокДолговПоРегистру(АдресВременногоХранилища);	
	ЭтаФорма.Закрыть(АдресВременногоХранилища);	
	
КонецПроцедуры
